{
  "provider_name": "Binance",
  "slug": "binance",
  "model_version": "1.0",
  "introduction": "Binance's lending arm operates under a Dubai VARA VASP licence issued 15 Apr 2024 that explicitly covers \"Lending and Borrowing Services,\" giving it a formal (but still young) regulatory footing. Disputes, however, are governed by Hong Kong law with HKIAC arbitration, and the firm still has no settled global headquarters, leaving creditors to rely on contract arbitration rather than a proven bankruptcy court.",
  "highlights": "Under Binance's Flexible Rate Loan, client BTC collateral is immediately rehypothecated via Simple Earn and swept into pooled omnibus wallets with no bankruptcy-remote segregation. Liquidations hinge on a Binance-run price index, a thin 13 pp buffer, and minute-to-minute variable rates. Past failures (including a 7,000 BTC hot-wallet hack, a mass KYC data leak exposing ~60,000 users, and a US $4.3B DOJ settlement) underscore the counter-party risk. Segregating collateral with a regulated trustee, reviving third-party PoR audits, adopting independent multi-signer oracles, and widening the collateral cushion would sharply reduce exposure.",
  "status": "active",
  "is_beta": false,
  "notes": "",
  "details": {
    "launch_year": 2023,
    "website": "https://www.binance.com/en/loan",
    "custody_model": "CeFi",
    "custodians": ["In-house"],
    "collateral_type": ["BTC", "ETH", "BNB", "Others"],
    "rehypothecation": "Yes",
    "kyc": "Yes",
    "loan_type": ["Consumer"],
    "loan_currency": ["USDC", "USDT", "ETH", "Others"],
    "support_channels": ["Chat"],
    "apr_type": {
      "value": "Variable",
      "note": ""
    },
    "ltv": {
      "value": 78,
      "unit": "%",
      "note": ""
    },
    "margin_call": {
      "value": [85],
      "unit": "%",
      "note": ""
    },
    "liquidation_ltv": {
      "value": 91,
      "unit": "%",
      "note": ""
    },
    "loan_value_min": {
      "value": 1,
      "unit": "USD",
      "note": ""
    },
    "loan_value_max": {
      "value": 5500000,
      "unit": "USD",
      "note": ""
    },
    "loan_duration_min": {
      "value": 0,
      "unit": "month",
      "note": "Flexible"
    },
    "loan_duration_max": {
      "value": 0,
      "unit": "month",
      "note": "Flexible"
    },
    "total_loan_issued": {
      "value": 0,
      "unit": "USD",
      "note": "N/A"
    },
    "apr_min": {
      "value": 6.3,
      "unit": "%",
      "note": ""
    },
    "apr_max": {
      "value": 6.3,
      "unit": "%",
      "note": ""
    },
    "origination_fee": {
      "value": 0,
      "unit": "%",
      "note": ""
    },
    "interest_rate_min": {
      "value": 6.3,
      "unit": "%",
      "note": ""
    },
    "interest_rate_max": {
      "value": 6.3,
      "unit": "%",
      "note": ""
    }
  },
  "factors": {
    "collateral": {
      "score": 0,
      "note": "Native BTC (on-chain UTXO).",
      "evidence": []
    },
    "rehypothecation": {
      "score": 7,
      "note": "BTC used as collateral for Binance Loans (Flexible Rate) is automatically subscribed to Simple Earn, where it can be re-lent via Margin and Loan products—a clear case of rehypothecation beyond internal segregation.",
      "evidence": []
    },
    "custody": {
      "score": 7,
      "note": "Centralized, pooled hot-/cold-wallet custody run by Binance; no independent qualified custodian or bankruptcy-remote segregation.",
      "evidence": []
    },
    "security_governance": {
      "score": 7,
      "note": "Retail assets are swept from user deposit addresses into Binance-controlled omnibus hot wallets, so balances remain pooled without on-chain segregation. Its Merkle-tree proof-of-reserves is produced internally and has lacked an external auditor since Mazars halted PoR work in Dec 2022, leaving custody controls unaudited. Binance also suffered a 7,000 BTC hot-wallet breach in May 2019, and the segregated MPC cold-storage offered via Ceffu is marketed solely to institutional clients, not to retail funds.",
      "evidence": []
    },
    "platform": {
      "score": 0,
      "note": "Native Bitcoin script.",
      "evidence": []
    },
    "oracle": {
      "score": 7,
      "note": "Binance runs its own Price Index (no third-party feed) to set LTV and liquidation thresholds. The index blends ≥10 major exchanges (KuCoin, OKX, Coinbase, Kraken, Bitfinex, Bybit, etc..), but Binance fully controls the oracle and can reweight it at will. No independent signers or on-chain proof.",
      "evidence": []
    },
    "liquidation_buffer": {
      "score": 4,
      "note": "13pp buffer (78% → 91%). Margin call at 85% with no stated grace window.",
      "evidence": []
    },
    "rate_and_term": {
      "score": 7,
      "note": "Under Binance's Flexible Rate Loan, the interest rate floats minute-by-minute with no stated cap; borrowers bear the full rate volatility.",
      "evidence": []
    },
    "transparency": {
      "score": 4,
      "note": "Publishes in-house Merkle tree Proof-of-Reserves snapshots for assets only, while liabilities and full financials remain undisclosed. Individual loan UTXOs are not visible; only aggregated balances across exchange wallets are presented.",
      "evidence": []
    },
    "loan_currency": {
      "score": 4,
      "note": "Wide range of cryptocurrencies including USDC, USDT, ETH, and others.",
      "evidence": []
    },
    "privacy": {
      "score": 10,
      "note": "Mandatory KYC with a confirmed 2019 leak exposing up to 60,000 users' identity documents.",
      "evidence": []
    },
    "history": {
      "score": 7,
      "note": "A major 7,000 BTC hack in 2019 and a US$4.3 billion settlement with the DOJ and FinCEN in 2023 highlight serious past failures in security and compliance — though users were reimbursed. Additionally, a 2019 data leak exposed identity documents of up to 60,000 users.",
      "evidence": []
    },
    "jurisdiction": {
      "score": 4,
      "note": "Binance's lending arm operates under a Dubai VARA VASP licence issued 15 Apr 2024 that explicitly covers \"Lending and Borrowing Services,\" giving it a formal (but still young) regulatory footing. Disputes, however, are governed by Hong Kong law with HKIAC arbitration, and the firm still has no settled global headquarters, leaving creditors to rely on contract arbitration rather than a proven bankruptcy court.",
      "evidence": []
    }
  }
}
