{
  "provider": "arch",
  "logs": [
    {
      "action": "bootstrap",
      "changedAt": "2025-08-07T00:00:00Z",
      "changedBy": "migration-script",
      "changes": {},
      "note": "Changelog system initialized. Historical changes before this date are not tracked."
    },
    {
      "action": "update",
      "changedAt": "2025-08-12T15:02:01.608Z",
      "changedBy": "tocomax",
      "commit": "3566b205",
      "commitMessage": "chore: update interest rates and APR values for multiple providers to reflect recent changes",
      "changes": {
        "details.apr_min.value": {
          "from": 14,
          "to": 12.5
        },
        "details.apr_max.value": {
          "from": 14,
          "to": 12.5
        },
        "details.interest_rate_min.value": {
          "from": 12.5,
          "to": 11
        },
        "details.interest_rate_max.value": {
          "from": 12.5,
          "to": 11
        }
      }
    },
    {
      "action": "update",
      "changedAt": "2025-10-23T02:11:34.046Z",
      "changedBy": "tocomax",
      "commit": "e3691564",
      "commitMessage": "feat: update Arch Lending's score",
      "changes": {
        "highlights": {
          "from": "Uses native BTC escrow but offers no public proof-of-reserves and depends on a single oracle, leaving users blind to hidden leverage or price-feed failure. Live PoR and multiple independent pricing sources would materially shrink uncertainty.",
          "to": "Anchorage custody in bankruptcy-remote trusts is a solid base, but Arch publishes no public proof of reserves and liabilities and discloses no SOC 2 for its own platform. Ship continuous, publicly verifiable PoR and a SOC 2 Type II so customers get verifiable reserves and audited security."
        },
        "factors.oracle.score": {
          "from": 10,
          "to": 4
        },
        "factors.oracle.note": {
          "from": "Arch Lending's public materials never disclose where their BTC-USD price comes from, how often it updates, or whether more than one exchange is consulted.",
          "to": "Arch discloses a single third-party oracle: CoinMarketCap's market price feed, refreshed roughly every 60 seconds. CoinMarketCap aggregates quotes from multiple exchanges and applies data-cleaning/outlier filters before publishing a USD price. Arch adds guardrails (alerts for stale prices and a manual hold on liquidations when an 'extreme' LTV is computed), which reduces auto-liquidation risk from a bad tick."
        }
      }
    }
  ]
}
